Revit 2027 API
FormattedText.SetSuperscriptStatus(Boolean) Method
 Sets the characters in the entire text to be superscript or not superscript.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSuperscriptStatus(
	bool isSuperscript
)
Public Sub SetSuperscriptStatus (
	isSuperscript As Boolean
)
public:
void SetSuperscriptStatus(
	bool isSuperscript
)
member SetSuperscriptStatus :
        isSuperscript : bool -> unit
Parameters
isSuperscript Boolean
 The desired superscript status of characters in the entire text. True to set superscript, false to set not superscript.
Remarks
 If the characters are set to be superscript, they cannot be subscript. This sets the subscript status to false.
See Also
Reference
FormattedText Class
SetSuperscriptStatus Overload
Autodesk.Revit.DB Namespace